# -*- coding: utf-8 -*-
"""
Charles Truscott
ЧАРЛьЗ ТРУСКОТТ
runfile('C:/Users/user/Desktop/куажратик.py', wdir='C:/Users/user/Desktop')
The quadratic root of 2481 is 7.057594322547102. 7.057594322547102 ** 4 = 2481.0
2481 ЗТО КУАДРАТЙК РУТ 7.057594322547102

"""

def main():
    гиссйс = 0
    ыпс = 0.000001
    куаж = 2481
    хи = куаж
    лу = 0
    гисс = (хи + лу) / 2.0
    while ((гисс ** 4) != куаж):
        if ((гисс ** 4) > куаж):
            хи = гисс
        elif ((гисс ** 4) < куаж):
            лу = гисс
        гиссйс += 1
        гисс = (хи + лу) / 2.0
    print("The quadratic root of {} is {}. {} ** 4 = {}".format(куаж, гисс, гисс, гисс ** 4))
    print("{} ЗТО КУАДРАТЙК РУТ {}".format(куаж, гисс))
    
if __name__ == "__main__": main()
